package arrayapp;

/**
 * Работа с массивами в Java
 * @author imxo
 */
public class ArrayApp {

    public static void main(String[] args) {
        long[] arr;                             //Ссылка на массив
        arr = new long[100];                    //Создание массива
        int nElems = 0;                         //Количество элементов
        int j;                                  //Счётчик цикла
        long searchKey;                         //Ключи искомого элемента
        //----------------------------------------------------------------------
        arr[0] = 77;                            //Вставка 10 элементов
        arr[1] = 99;
        arr[2] = 44;
        arr[3] = 55;
        arr[4] = 22;
        arr[5] = 88;
        arr[6] = 11;
        arr[7] = 0;
        arr[8] = 66;
        arr[9] = 33;
        nElems = 10;                            //Массив содержит 10 элементов
        //----------------------------------------------------------------------
        for(j = 0; j < nElems; j++)             //Вывод элементов
            System.out.print(arr[j] + " ");
        System.out.println();
        //----------------------------------------------------------------------
        searchKey = 66;                         //Поиск элемента с ключём 66
        for (j = 0; j < nElems; j++)            //Для каждого элемента
            if(arr[j] == searchKey)             //Значение найдено?
                break;                          //Да - выход из цикла
        if(j == nElems)                         //Достигнут последний элемент?
            System.out.println("Не удается найти " + searchKey);    //Да
        else
            System.out.println("Найдено " + searchKey);             //Нет
        //----------------------------------------------------------------------
        searchKey = 55;                         //Поиск элемента с ключём 55
        for (j = 0; j < nElems; j++)            //Поиск удаляемого элемента
            if(arr[j] == searchKey)             
                break;                          
        for(int k = j; k < nElems; k++)         //Сдвиг последующихэлементов
            arr[k] = arr[k+1];
        nElems--;                               //Уменьшение размера
        //----------------------------------------------------------------------
        for (j = 0; j < nElems; j++)            //Вывод элементов
            System.out.print(arr[j] + " ");
        System.out.println();
    }
}
